Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །དགའ་བ་དང་བདེ་བ་གང་དེ་འཕགས་པས་བརྗོད་པ། ལྷ་ཡུལ་བ་རྒྱ་ཆེ་ཞིང་དཔེ་མེད་པ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་དུ་རིག་པ་རབ་ཏུ་ཐོབ་བོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: He attained the knowledge of the joy and happiness that is described by the noble ones, of the countless vast number of beings in the deva realms, and the scope of experience of the buddhas and bodhisattvas. It was said: The Bhagavān placed upon the head of the youth Candraprabha The hand that for many millions of eons had given away jewels,

source: དྲ་བས་མཛེས་འབྲེལ་བུམ་པ་ལྕགས་ཀྱུའི་མཚན་མངའ་ཞིང་།
en: Which was beautified by being webbed, and had markings of a vase and hook,

source: །དཔལ་བེའུ་འཁོར་ལོ་རྒྱལ་མཚན་བ་དན་ཉ་རིས་མངའ།
en: A knot of eternity, a wheel, a victory banner, a flag, and fishes. {ii}

source: །བསྐལ་པ་བྱེ་མང་རིན་ཆེན་གཏོང་ལ་ཞུགས་པའི་ཕྱག །བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུའི་སྤྱི་བོར་བཞག །དེ་ནས་ལྷ་ཡུལ་པ་རྒྱ་ཆེ་ཞིང་དཔེ་མེད་པ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་དུ་རིག་པའི་དགའ་བ་དང་། བདེ་བ་དང་ལྡན་པར་གྱུར་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Then Candraprabha, full of joy and happiness and the knowledge of the countless, vast number of beings in the deva realms, and the scope of experience of the buddhas and bodhisattvas, rose from his seat, removed his robe from one shoulder, and, kneeling on his right knee, with palms placed together, he bowed toward the Bhagavān and recited these appropriate verses of praise:

source: །བླ་མེད་མི་འཇིགས་སྦྱིན་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: “I pay homage to you, the unsurpassable provider of freedom from fear.

source: །གཞན་ཕན་སེམས་ཅན་གཉེན་རྩ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, a loving friend of beings who benefits others.

source: །སྟོབས་བཅུ་བདེན་པའི་རྩལ་མངའ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, who possess the power of truth and the ten strengths.

source: །བདེ་གཤེགས་མི་མཉམ་མཉམ་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, who are the equal of the unequaled tathāgatas. {iii}

source: །མགོན་པོ་ཤིན་ཏུ་ཐུགས་རྗེ་ཅན་ལ་ཕྱག་འཚལ་ལོ།
en: “I pay homage to you, the Lord who has the highest compassion.

source: །དཔའ་བོ་དགྲ་བཞི་རྣམ་པར་བཏུལ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, the hero who has subjugated the four enemies.

source: །བརྩོན་པ་དམ་པའི་དོན་རྣམས་མཁྱེན་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, who know the benefits of sublime diligence.

source: །ཆོས་ཀྱི་སྐུ་མཆོག་མངའ་བའི་ལྷ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, the Lord who has the supreme dharmakāya. {iv} “I will always go for refuge to you, Lord,

source: །སྙིང་རྗེ་བྱམས་འོད་རྒྱལ་བའི་ཉི་མ་མུན་སེལ་བ། །ཤེས་རབ་ཤིན་ཏུ་ཡངས་པའི་ནམ་མཁའི་དཀྱིལ་དུ་ཤར།
en: The Jina who is a sun shining in the center of the vast sky of wisdom, Dispelling darkness with the light of love and compassion,

source: །དོན་དམ་ཤིན་ཏུ་ཟབ་པའི་ཆོས་རྣམས་སྟོན་མཛད་པ། །ལྷ་ཁྱོད་ལ་ནི་རྟག་ཏུ་བདག་ཀྱང་སྐྱབས་སུ་མཆི།
en: And who is the teacher of the extremely profound Dharma of the ultimate truth.” {v}

source: །དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་དག་གིས་མངོན་པར་བསྟོད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་སང་བདག་གི་སྡུམ་པར་བཤོས་གསོལ་བར་ཐུགས་ལ་གནང་བར་མཛད་དུ་གསོལ། དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: When the youth Candraprabha had recited these appropriate verses of praise to the Bhagavān, he said to him, “Bhagavān, so that you may show me your compassion I pray that you, with your saṅgha of bodhisattvas and saṅgha of bhikṣus, will assent to eat your meal tomorrow at my home.

source: བདག་གི་སྡུམ་པར་གཙང་མའི་བཤོས་གསོལ་བར། །མི་དབང་སྲས་དང་བཅས་ལ་གསོལ་བ་འདེབས།
en: “I pray to the Lord of men and your sons That you eat a pure meal at my home.

source: །ཐུབ་པའི་དབང་པོ་བདག་ལ་ཐུགས་བརྩེའི་ཕྱིར།
en: Lord of sages, in order to show me your compassion,

source: །མགོན་པོ་ལྷ་ཡི་གཙོ་བོས་གནང་བར་མཛོད།
en: Chief of devas, give your assent.” {vi}

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བརྩེ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པའི་ཁྱིམ་དུ་བཤོས་གསོལ་བར་ཅང་མི་གསུང་བར་གྱུར་པས་གནང་ངོ་།
en: The Bhagavān, because of his compassion, by remaining silent assented to eat a meal together with his saṅgha of bodhisattvas and saṅgha of bhikṣus at the home of the youth Candraprabha.

source: །དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གྱུར་པས་གནང་བར་རིག་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་ནས་སོང་ངོ་།
en: The youth Candraprabha, knowing that the Bhagavān had assented by his silence, rose from his seat, removed his robe from one shoulder, bowed his head to the Bhagavān’s feet, circumambulated the Bhagavān three times, and departed from the Bhagavān’s presence.

source: །དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལས་བབས་ནས་དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་བར་དུ་དེའི་བར་གྱི་ལམ་ཐམས་ཅད་ལེགས་པར་བརྒྱན་ཏེ།
en: The youth Candraprabha then went down from Vulture Peak Mountain, and at that time he perfectly adorned the entire road in between Vulture Peak Mountain and the great city of Rājagṛha.

source: འདི་ལྟར་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ལམ་ཡངས་ཤིང་ཆེ་ལ་རྩྭ་དང་སྡོང་དུ་མ་དང་ཚེར་མ་དང་རྡོ་དང་གྱོ་མོ་དང་གསེག་མ་མེད་པར་བསལ་ཏེ་བྱེ་མ་གཙང་མས་བདལ་ནས། ཀ་ཙ་ལིན་དི་ཀ་ལྟར་འཇམ་ཞིང་རེག་ན་བདེ་བ། དབྱངས་དགའ་བར་བྱས་ཏེ།
en: As an offering to the Bhagavān he cleared a great, wide roadway so that it was free of grass, tree stumps, thorns, stones, pebbles, and gravel, and spread pure sand over it, so that it was as soft and pleasant to the touch as down, and made a pleasant sound.

source: ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། དྲི་མཆོག་དང་། ཨ་ཏི་མུག་ཏ་ཀ་དང་། མཱ་ལི་ཀ་དང་། ཙམ་པ་ཀ་དང་། སྐྱ་སྣར་དང་། ཀུན་ད་དང་། ཏི་ལ་ཀ་དང་། ཀེ་ས་ར་དང་། མྱ་ངན་འཚང་ལ་སོགས་པ་དུས་ཐམས་ཅད་ཀྱི་མེ་ཏོག་བཟང་པོས་ནི་ཀུན་ཏུ་ཁེབས་པར་བྱས།
en: He covered it with flowers from all seasons, such as divine blue lotuses, red lotuses, night lotuses, white lotuses, water lilies, kachnar flowers, sambac jasmines, magnolias, bignonias, star jasmines, sesame flowers, ironwood flowers, and aśoka flowers.

source: གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་དང་རྣམ་པར་རྒྱལ་བའི་བ་དན་དང་རིན་པོ་ཆེའི་རྟ་བབས་དང་བླ་རེ་ནི་བྲེས། རིན་པོ་ཆེའི་བདུག་སྤོས་ཀྱི་སྣོད་སྣ་ཚོགས་ནི་ངོས་ལ་སྤྱངས།
en: Parasols, banners, flags, flags of victory, precious arches, and canopies were set up along the road.

source: རིན་པོ་ཆེའི་བདུག་སྤོས་ཀྱི་སྣོད་དེ་དག་ཐམས་ཅད་ནས་ནི་ཨ་ག་རུ་ནག་པོས་གང་བའི་དུ་བ་འཐུལ། ཕྱོགས་ཕྱོགས་སུ་ནི་བྲོ་མཁན་དང་གར་མཁན་ལྷའི་གླུ་གར་དང་རོལ་མོ་ཤིན་ཏུ་འབྱོར་ཅིང་ལེགས་པར་བསླབས་པ་རྣམས་བཀོད།
en: There were precious censers from which flowed the smoke of black agarwood. Arranged in different places were dancers and performers skilled in performing divine songs, dance, and music.

source: སྐྱེས་པ་དང་བུད་མེད་དང་ཁྱེའུ་དང་བུ་མོ་ཤིན་ཏུ་བརྒྱན་པ་ཁར་རྔ་དང་ཏུ་ཎ་བ་དང་པི་བང་རྒྱུད་གཅིག་པ་དང་པི་བང་དང་གླིང་བུ་དང་རྫ་རྔ་དང་རྔ་མུ་ཀུན་ད་དང་རྫ་རྔ་ཆེན་པོ་ཐོགས་པ་རྣམས་བཀོད། ལམ་གྱི་ངོས་གཉིས་སུ་ཤིང་ཏ་ལ་མཐོན་པོ་ལྷའི་རིན་པོ་ཆེ་སྣ་ཚོགས་དང་འཛམ་བུའི་ཆུ་བོའི་གསེར་ལས་བྱས་པའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་བྲེས་ཤིང་སྒྲ་འཁྲོལ་བས་བརྒྱན་པ་རྣམས་དང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མཁའ་རྟེན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་སྣ་ཚོགས་ཁྲུན་དང་སྦོམས་སུ་ལྡན་པ་སྣ་ཚོགས་དང་དུས་ཐམས་ཅད་ཀྱི་ལོ་མ་དང་། མེ་ཏོག་དང་འབྲས་བུ་ཕུན་སུམ་ཚོགས་པ་དག་བཙུགས་སོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: Beautifully adorned men, women, boys, and girls were arranged holding paṇava drums, one-stringed lutes, lutes, flutes, mṛdaṅga drums, mukunda drums, and muraja drums. On both sides of the road tall palm trees were adorned with various divine jewels and a jingling network of bells made from Jambu River gold. There were many hundred thousand quintillions of pillars made of precious materials, and different kinds of trees of various heights and thicknesses made from the seven jewels, and on which were arranged the leaves, flowers, and fruits of all seasons.

source: ལམ་ནི་སྣ་ཚོགས་ཤིན་ཏུ་ལེགས་པར་བརྒྱན། །བླ་རེས་དང་ནི་གདུགས་དང་བ་དན་སྒྲེང་།
en: The road was excellently adorned in various ways. Canopies, parasols, and flags were erected.

source: །སིལ་སྙན་དག་གི་སྒྲ་དག་རབ་ཏུ་འབྱིན།
en: The sound of music was perfectly played,

source: །གླུ་སྒྲ་ཡིད་དུ་འོང་བའང་དེ་བཞིན་ཏེ།
en: And similarly there was the beautiful sound of songs. {vii} That perfect road was excellently adorned

source: །བུད་མེད་མང་པོ་བྲོ་རྡུང་གར་བྱེད་དང་། །གོས་བཟང་ཁྲག་ཁྲིག་རྣམ་མང་སྣ་ཚོགས་དང་། །མེ་ཏོག་ཕྲེང་བ་བཟང་ཞིང་མཛེས་པ་ཡིས། །ལམ་མཆོག་ཡངས་པ་དེ་ནི་རབ་ཏུ་བརྒྱན།
en: By many women performing dances, Many millions of various excellent cloths, And beautiful, excellent garlands of flowers. {viii}

source: །གྲོང་མཆོག་གཙང་མ་འདིར་ནི་ཐུགས་རྗེ་ཅན། །སངས་རྒྱས་ཐུབ་པའི་ཟླ་བ་གཤེགས་སོ་ཞེས།
en: “The Buddha, the moon of sages, the compassionate one Is coming to this pure excellent city.”

source: །ཟླ་འོད་གཞོན་ནུས་དད་པ་རབ་བསྐྱེད་ནས།
en: On hearing that, young Candraprabha with great faith

source: །རྒྱ་ཆེ་ཡངས་པའི་ལམ་ནི་ཤིན་ཏུ་བརྒྱན།
en: Perfectly adorned a great, vast road. {ix}

source: །ལྷ་རྫས་ཀྱི་ནི་བྱེ་མ་གཙང་མ་བདལ།
en: He spread out pure, divine sand

source: །རབ་ཏུ་ཡིད་འོང་མེ་ཏོག་མཆོག་རྣམས་བཀྲམ།
en: And scattered perfect, beautiful flowers.

source: །རིན་ཆེན་རྟ་བབས་དག་ཀྱང་ལེགས་པར་བཙུགས།
en: He also set up precious pillars

source: །ལམ་ནི་ལྷ་ཡི་གྲོང་ཁྱེར་བཞིན་དུ་མཛེས།
en: And made the road as beautiful as a divine city. {x}

source: །ཟླ་འོད་གཞོན་ནུ་ཤིན་ཏུ་ཡིད་དགའ་བས།
en: Young Candraprabha, with immense joy,

source: །དེ་ལྟར་ལམ་རྣམས་སྣ་ཚོགས་ལེགས་བརྒྱན་ཏེ།
en: Perfectly adorned the road in various ways.

source: ལྷ་དང་ལྷ་མིན་ཀླུ་ཡིས་དེ་མཐོང་ནས།
en: Devas, asuras, and nāgas, upon seeing it

source: །ངོ་མཚར་གྱུར་ཅིང་ཨ་ལ་ལ་ཞེས་སྨྲ།
en: Were astonished and cried out, “Ha ha ha!” {xi}

source: །ལམ་གྱི་གཡས་གཡོན་འཛམ་བུའི་ཆུ་གསེར་གྱི། །ཏ་ལ་མཐོ་ཞིང་བཟང་ལ་ཟླུམ་པ་དག །རིན་ཆེན་དྲིལ་བུའི་དྲ་བས་གཡོགས་ཤིང་དཀྲིས།
en: To the left and right of the road there were placed Tall, excellent, round palm trees made of Jambu River gold, Decorated and beautified by a network

source: །སྒྲ་འཁྲོལ་རྣམ་པ་དུ་མ་མང་པོ་བཙུགས།
en: Of numerous jingling, precious bells. {xii}

source: །དེ་བཞིན་རིན་ཆེན་སྡོང་པོ་ཁྲག་ཁྲིག་ནི།
en: Similarly arranged were million of precious trees

source: །དུས་ཀུན་གྱི་ཡང་མེ་ཏོག་རྒྱས་པ་བཙུགས།
en: Adorned by blossomed flowers of all seasons,

source: །དེ་ཡིས་ཡངས་པའི་ལམ་བརྒྱན་མཛེས་གྱུར་པ།
en: Which were beautiful adornments for that vast road,

source: །མཐོ་རིས་ན་ནི་དགའ་བའི་ཚལ་བུ་བཞིན།
en: Like a blissful park in the deva realms. {xiii}

source: །རིན་པོ་ཆེ་ལས་བྱས་པའི་མཁའ་རྟེན་ནི།
en: Pillars that were made from precious materials,

source: །དྲ་བའི་ཆུན་པོ་འོད་འབར་ཤིན་ཏུ་མཛེས།
en: With beautiful strings of beads that shone like light—

source: །དཔེ་མེད་མཐོང་ཞིང་ཆེ་ལ་རྒྱས་པ་དག །ལམ་གྱི་གཡས་གཡོན་འགྲམ་དུ་བཙུགས་ཤིང་བཀོད།
en: An indescribable sight, huge and vast— Were set up and arranged on the left and right of the road. {xiv}

source: །སངས་རྒྱས་འཇིག་རྟེན་གསུམ་དབང་གང་ནས་ནི།
en: The Buddha, the Lord of the three worlds,

source: །རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་དུ་གཤེགས་པ་ཡི།
en: Traveled on that road to the capital city.

source: །ལམ་ཆེན་དེ་ནི་དེ་དག་རབ་བརྒྱན་པས།
en: That great road was adorned in that way

source: །རྣམ་པ་ཐམས་ཅད་དུ་ཡང་མཛེས་པར་གྱུར།
en: So that it was beautiful in every way. {xv}

source: །གཡས་གཡོས་སུ་ནི་རིན་ཆེན་པོག་ཕོར་དཔྱངས།
en: On the right and left, precious censers were hung.

source: །དེ་དག་ཨ་ག་རུ་ཡང་ནག་པོས་བཀང་།
en: They were filled with black agarwood.

source: །པོག་ཕོར་ཀུན་ནས་དུ་བ་སྤྲིན་བཞིན་འཁྲིགས།
en: From all the censers there formed a cloud of smoke,

source: །ལྷ་ཡི་དྲི་ཞིམ་རྣམ་པ་སྣ་ཚོགས་འབྱུང་། །ཇི་སྲིད་གྲོང་ཁྱེར་ཆུ་དྲོན་སྒོ་བར་དང་། །རི་རྒྱལ་བྱ་རྒོད་ཕུང་པོ་ཇི་སྲིད་པར།
en: With divine, pleasant aromas of various kinds. {xvi}

source: །ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་རྒྱལ་བའི་ཕྱིར། །ལྷ་རྫས་དཔེ་མེད་ཡངས་པས་བརྒྱན་པ་བྱས།
en: The youth Candraprabha, for the sake of the Jina, Arranged vast, incalculable ornaments of divine materials, From the entrance to the water well of the city Up to the king of mountains, Gṛdhrakūṭa. {xvii}

source: །དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་ལམ་དེ་རིན་པོ་ཆེ་བཀོད་པ་རྣམ་པ་སྣ་ཚོགས་དུ་མས་བརྒྱན་པ་བྱས་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལས་བབས་ཏེ། རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་གང་ན་བ་དང་རང་གི་ལྷའི་ཁྱིམ་མཐོ་ཞིང་ཆེ་ལ་ཡངས་པ་གང་ན་ཡོད་པ་དེར་སོང་སྟེ་ཕྱིན་ནས་རང་གི་ཁྱིམ་དུ་ཞུགས་སོ།
en: Young Candraprabha adorned the road with many different precious arrangements. Then young Candraprabha descended from Vulture Peak and went to the great city of Rājagṛha, to his tall, vast, great, divine home.

source: །ཞུགས་ནས་བཟའ་བ་དང་བཅའ་བ་དང་མྱང་བ་མང་ཞིང་བཟང་བ་གཡོར་བཅུག་སྟེ། ཞལ་ཟས་རོ་སྣ་བརྒྱ་པ་སྦྱར་ནས་དེའི་མཚན་མོ་འདས་པ་དང་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ཆག་ཆག་ལེགས་པར་བཏབ།
en: He reached there and he entered his home. He spent that night preparing a great amount of excellent, delicious food and drink, and creating food that had a hundred flavors.

source: བྱི་དོར་ལེགས་པར་བྱས་ནས་མེ་ཏོག་སིལ་མ་ནི་བཀྲམ། བདུག་སྤོས་ཀྱིས་ནི་བདུགས། བླ་རེ་ནི་བྲེས། དར་གྱི་ལྡ་ལྡི་དང་ཆུན་པོ་ནི་དཔྱངས། གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་ནི་བསྒྲེང་སྟེ།
en: Then he sprinkled well the ground in the great city of Rājagṛha and swept it clean, scattered flower petals, perfumed it with incense, put up canopies, hung ribbons and wreaths of silk, and set up parasols, banners, and flags.

source: དེ་ལྟར་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་ལམ་སྲང་དང་གྲོང་བར་དུ་བཅས་པ་རྡོ་དང་གྱོ་མོ་དང་གསེག་མ་མེད་པར་བྱས། མེ་ཏོག་སྣ་ཚོགས་ནི་བཀྲམ། ཙན་དན་གྱི་ཕྱེ་མས་ནི་གཏོར།
en: In that way he made the main road of Rājagṛha up to the town free of stones, pebbles, and gravel, scattered it with various flowers, and sprinkled it with sandalwood powder.

source: སྐར་ཁུང་དང་རྟ་བབས་དང་སྒོ་གང་དང་བ་གམ་དང་སྐར་ཁུང་དྲ་བ་རིས་དང་ཟླ་བ་ཁམ་པ་ལྟ་བུས་ནི་བརྒྱན་ཅིང་ཙན་དན་གྱིས་བྱུག་པ་བྱས་ཏེ།
en: He adorned the windows, porticoes, doors, roofs, lattices, and the crescent moons, and perfumed them with sandalwood.

source: དེ་ལྟར་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་དཔག་ཏུ་མེད་པའི་བཀོད་པས་རབ་ཏུ་བརྒྱན་ནས། རང་གི་ཁྱིམ་ཡང་རྒྱན་སྣ་ཚོགས་པ་རྣམ་པ་དུ་མས་བརྒྱན་ཏེ།
en: In that way he adorned the city of Rājagṛha with countless displays and adorned his own house, too, with a variety of many adornments.

source: རིན་པོ་ཆེའི་ཕྲེང་བ་རྣམ་པ་དུ་མ་ནི་རབ་ཏུ་དཔྱངས།
en: He hung it with many precious strings of beads.

source: དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷའི་གོས་ཀྱིས་ནི་བརྒྱན་ཅིང་ཉེ་འཁོར་ཡང་མཛེས་པར་བྱས།
en: He adorned it with the raiment of the Tuṣita deities and also beautified the grounds.

source: ཕྲེང་བ་དང་ལྡ་ལྡི་རྣམ་པ་ཐ་དད་པ་དུ་མས་ནི་བརྒྱན་པ་བྱེད་དུ་བཅུག །རིན་པོ་ཆེའི་སྟན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ནི་འདིང་དུ་བཅུག་སྟེ།
en: He had many kinds of garlands and wreaths put up as adornments. He arranged a hundred thousand precious seats.

source: བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་དེའི་དབུས་སུ་བཅོམ་ལྡན་འདས་ཀྱི་ལྷ་རྫས་ཀྱི་སེང་གེའི་ཁྲི་ལྷའི་དང་མིའི་ལས་འདས་པ་བཤམས་སོ།
en: In order to make offerings to the Bhagavān he placed in their center a lion throne of divine materials that surpassed the work of devas and humans.

source: །རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་པོག་ཕོར་ནི་ཕྱོགས་བཞིར་དཔྱངས་ཏེ། དེ་དག་ནས་ཨ་ག་རུ་འབའ་ཞིག་གི་དུ་བ་འཐུལ་བར་བྱས་སོ།
en: In the four directions he hung censers made of various precious materials, from which flowed the smoke of black agarwood.

source: །ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་ཁྱིམ་མཆོག་དེ་ཡང་འདི་ལྟ་སྟེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཡོངས་སུ་ལོངས་སྤྱད་པའི་ཕྱིར་ལྷའི་གླུ་གར་དང་སིལ་སྙན་ནི་བསྒྲགས། གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་ནི་བསྒྲེང་།
en: In that way the youth Candraprabha arranged his excellent home so that for the enjoyment of the Bhagavān there was the sound of divine songs, performances, and music;

source: ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དང་མི་དང་མི་མ་ཡིན་པ་བརྒྱ་སྟོང་གིས་ནི་གང་ཞིང་རྣམ་པར་བལྟས།
en: pure parasols and banners were erected; an audience of a hundred thousand devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans thronged it;

source: རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་རྣམ་པ་དུ་མས་ནི་གང་བར་བྱས་སོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། ཟླ་འོད་ཀྱིས་ནི་ཁྱིམ་མཆོག་ཡངས་པ་ཡང་།
en: and it was filled with many various kinds of precious flowers.

source: རྒྱ་ཆེར་ཐམས་ཅད་ཤིན་ཏུ་བརྒྱན་པར་བྱས།
en: Candraprabha perfectly, extensively adorned

source: །གང་ལ་འཇིག་རྟེན་སྒྲོན་མ་བཞུགས་པ་ཡི།
en: His vast and excellent home.

source: །ལྷ་རྫས་སེང་གེའི་ཁྲི་ནི་དབུས་སུ་བཙུགས།
en: In the center he placed a lion throne of divine materials

source: །འཇིག་རྟེན་སྒྲོན་མཛད་རྒྱལ་བའི་གཙོ་བོ་ཡི། །དགེ་འདུན་དག་ནི་གང་ལ་འདུག་འགྱུར་བ། །རིན་ཆེན་ཤིན་ཏུ་རྣམ་པར་བཀྲ་བའི་སྟན།
en: Where the lamp of the world would sit. {xviii}

source: །བྱེ་བ་སྟོང་ཕྲག་མཐའ་ཡས་ལེགས་པར་བཏིང་། །རིན་ཆེན་སྣ་ཚོགས་ཀུན་གྱི་བདུག་སྤོས་སྣོད།
en: He perfectly set out countless millions Of extremely precious, beautiful seats Where the saṅgha of the lamp of the world, The Lord of jinas, would sit. {xix} Censers made of all kinds of precious materials,

source: །ཨ་ག་རུ་ཡིས་ཤིན་ཏུ་གང་བྱས་ཏེ།
en: Completely filled with agarwood,

source: །ཕྱོགས་རྣམས་ཐམས་ཅད་དུ་ཡང་རྣམ་པར་དཔྱངས།
en: Were hung in all directions,

source: །དེ་དག་ནས་ནི་ཡིད་འོང་དྲི་རྣམས་འཐུལ།
en: And from them a beautiful aroma spread. {xx}

source: །ཟླ་འོད་ཀྱིས་ནི་སྟོབས་བཅུ་གཤེགས་པའི་ཕྱིར།
en: Candraprabha, in order to attain the ten strengths, Spread throughout the entire excellent grounds of the house

source: །རིན་ཆེན་མེ་ཏོག་མཛེས་པ་སྣ་ཚོགས་དང་། །མེ་ཏོག་དྲི་མཆོག་བཟང་པོ་རྣམ་མང་གིས། །ཁྱིམ་གྱི་ས་གཞི་བཟང་པོ་ཀུན་དུ་བཀྲམ།
en: Various kinds of beautiful, precious flowers— A multitude of excellent, aromatic flowers. {xxi}

source: །གར་བྱེད་གླུ་ལེན་སིལ་སྙན་སྒྲ་དག་གིས།
en: The sound of dancers, singers, and of music

source: །ཁྱིམ་མཆོག་ཐམས་ཅད་ཀུན་ཏུ་སྒྲ་ཡིས་གང་།
en: Filled the entire excellent house with sound.

source: །གདུགས་དང་བ་དན་དག་ཀྱང་ཤིན་ཏུ་བསྒྲེང་།
en: He erected also parasols and banners

source: །ཁྱིམ་ཀུན་ལམ་མེར་མཛེས་པ་ལྷ་ཡི་བཞིན།
en: So that the house was intensely beautiful, like that of a deity. {xxii}

source: །ཟླ་འོད་གཞོན་ནུའི་ཁྱིམ་མཆོག་ཆེན་པོ་ཡང་།
en: The vast excellent home of the youth Candraprabha

source: །སྐྱེས་བུ་ན་ཆུང་ཚོགས་ཀྱིས་རྒྱན་གྱུར་ཅིང་།
en: Was adorned by a multitude of young people.

source: །ཀླུ་དང་གནོད་སྦྱིན་ལྷ་མིན་མང་པོས་གང་།
en: It was filled with many nāgas, yakṣas, and asuras,

source: །བརྒྱ་ཕྲག་མང་པོའི་ལྷ་ཡིས་རྣམ་པར་བལྟས།
en: And was gazed upon by many hundreds of devas. {xxiii}

source: དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ཡང་བརྒྱན། བདག་གི་ཁྱིམ་ཡང་ལེགས་པར་བརྒྱན་ནས་དེའི་མཚན་མོ་འདས་པ་དང་། ནངས་པར་སྔ་རབས་ཀྱི་དུས་ཀྱི་ཚེ་སིལ་སྙན་སྣ་ཚོགས་བརྒྱ་དག་ནི་རབ་ཏུ་དཀྲོལ། གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་བྱེ་བ་དུ་མ་ནི་བསྒྲེང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་ཐམས་ཅད་ཀྱང་ལྷའི་མེ་ཏོག་མནྡཱ་རས་སྙིམ་པ་བཀང་སྟེ།
en: The young man Candraprabha, having adorned the great city of Rājagṛha and having perfectly beautified his own home, after the night was over, in the early morning, departed, accompanied by the music of hundreds of various kinds of instruments, with many millions of parasols, banners, and flags held high, and with an encircling vanguard of a great assembly of eight million quintillion bodhisattvas, their cupped hands filled with divine coral tree flowers.

source: དེ་དག་ལས་ལ་ལ་ནི་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ལྟ་སྟེ། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། མཐུ་ཆེན་ཐོབ་དང་། སྤོས་ཀྱི་གླང་པོ་ཆེ་དང་། རིན་པོ་ཆེའི་ཏོག་དང་། མངོན་པར་འབྱུང་དཀའ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། དཔའ་བོའི་སྡེ་དང་། ལག་བཟངས་དང་། རིན་ཆེན་མེ་ཏོག་དང་། མཐོང་བ་དོན་ཡོད་དང་། བྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། རྟ་དང་བ་ལང་དུ་མ་ཤིན་ཏུ་བརྒྱན་ཅིང་མ་ཞོན་པར་ཁྲིད་པ་མང་པོ་དང་འདྲེས་པ།
en: Among them were bodhisattvas with one life remaining, such as Avalokiteśvara, Mahā­sthāma­prāpta, Gandhahasti, Ratnaketu, Dundubhisvara, Durabhisambhava, Mañjuśrī Kumārabhūta, Vīrasena, Subāhu, Ratnakusuma, Amoghadarśin, Maitreya, and others, accompanied by many adorned horses and elephants without riders that were being led along, with an assembly of countless people of the country, his own cupped hands filled with divine coral tree flowers;

source: གཞན་ཡང་ཡུལ་གྱི་མི་དཔག་ཏུ་མེད་པའི་ཚོགས་དང་བདག་ཉིད་ཀྱང་ལྷའི་མེ་ཏོག་མནྡཱ་རས་སྙིམ་པ་བཀང་སྟེ་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཆེན་པོ་དང་བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་བྱང་ཆུབ་སེམས་དཔའི་ཆོ་འཕྲུལ་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཨ་ལ་ལ་ཞེས་ལྷའི་ག་ཞའི་སྒྲ་ཡིད་དུ་འཐད་ཅིང་ཡིད་དུ་འོང་བ་ཡིད་འཕྲོག་པ་དག་སྒྲོག་ཅིང་།
en: and they were accompanied by the enchanting, beautiful, harmonious sound of the laughter of the deities as they cried, “Oh, the bodhisattva’s great power! The bodhisattva’s great miracles! The bodhisattva’s great manifestations! The bodhisattva’s—a la la!”

source: རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་ཆུ་དྲོན་གྱི་སྒོ་ནས་ཕྱིར་བྱུང་སྟེ།
en: He came out through the hot springs gateway of the great city of Rājagṛha and went toward Vulture Peak Mountain, and to the Bhagavān.

source: རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོ་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ལྷའི་མེ་ཏོག་མནྡཱ་ར་བས་སྙིམ་པ་གང་བས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: When he arrived, he bowed his head to the Bhagavān’s feet, circumambulated the Bhagavān three times, sprinkled the divine coral tree flowers that filled his cupped hands over the Bhagavān, and went to sit down to one side.

source: །བྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། སོ་སོའི་སྙིམ་པ་ན་མེ་ཏོག་མནྡཱ་ར་བ་ཡོད་པ་དེས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ཕྱོགས་གཅིག་ཏུ་འདུག་པ་སྟན་ལས་ལངས་ཏེ།
en: Maitreya and the other bodhisattva mahāsattvas bowed their heads to the Bhagavān’s feet, circumambulated the Bhagavān three times, sprinkled the divine coral tree flowers that filled their cupped hands over the Bhagavān, and also sat down to one side.

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་གདུགས་ཚོད་ལ་བབ་པ།
en: Then the youth, who had sat to one side, rose from his seat, removed his robe from one shoulder, and, kneeling on his right knee, with palms placed together bowed toward the Bhagavān and said, “It is midday, Bhagavān, the time to eat.

source: བཅོམ་ལྡན་འདས་བཤོས་གཙང་སྦྱར་ལགས་ཏེ། ད་དེའི་དུས་ལ་བབ་པར་བཅོམ་ལྡན་འདས་ཀྱིས་མཁྱེན་ན། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་དགེ་སློང་གི་དགེ་འདུན་དུ་བཅས་པ་དང་དབང་ཆེ་བ་དང་། དབང་ཆེ་བར་གྲགས་པ་རྒྱ་ཆེ་ཞིང་རླབས་ཆེ་བའི་ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་དྲང་སྲོང་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དང་གྲུལ་བུམ་དང་ཡི་དགས་དང་སྲུལ་པོ་དང་མི་དང་མི་མ་ཡིན་པ་དག་དང་ཡང་ཐབས་ཅིག་ཏུ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་གཤེགས་ཤིང་བདག་གི་སྡུམ་པར་ཡང་གདུགས་ཚོད་གསོལ་བའི་དུས་ལ་བབ་བོ།
en: If the Bhagavān considers the time has come, then together with the saṅgha of bodhisattvas, the saṅgha of bhikṣus, and the devas, nāgas, yakṣas, gandharvas, asuras, rishis, garuḍas, kinnaras, mahoragas, kumbhāṇḍas, pretas, pūtanas, humans, and nonhumans who have great power, who are widely renowned for their great power and have great influence, come to the great city of Rājagṛha, as the time has come to eat the midday meal in my garden.

source: །བདེ་བར་གཤེགས་པ་གདུགས་ཚོད་ལ་བབ་བོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: Sugata, it is midday.

source: བདག་གིས་གྲོང་ཁྱེར་མཆོག་ཀུན་ལེགས་པར་བརྒྱན།
en: “I have adorned well the entire, excellent city,

source: །མགོན་པོ་བདག་གི་སྡུམ་པའང་དེ་བཞིན་ཏེ།
en: And similarly, Lord, my garden.

source: །ལྷ་ཡི་ཞལ་ཟས་རོ་བརྒྱ་བཤམས་ཤིང་སྦྱར།
en: I have prepared and laid out divine food with a hundred flavors.

source: །གདུགས་ཚོད་བབ་ཀྱིས་བདེ་གཤེགས་བཞེངས་སུ་གསོལ།
en: As it is midday, I pray to the Sugata to arise. {xxiv}
